In [1]:
import pandas as pd
import numpy as np

In [2]:
dict = {'Name':['AAA','BBB','CCC','DDD'],
        'Physics':[100, 90, np.nan, 95], 
        'Chemistry': [30, 45, 56, np.nan], 
        'Maths':[np.nan, 40, 80, 98]} 

df=pd.DataFrame(dict)
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0    NaN
1  BBB     90.0       45.0   40.0
2  CCC      NaN       56.0   80.0
3  DDD     95.0        NaN   98.0

In [3]:
df.isnull()

    Name  Physics  Chemistry  Maths
0  False    False      False   True
1  False    False      False  False
2  False     True      False  False
3  False    False       True  False

In [4]:
df.isnull().sum()

Name         0
Physics      1
Chemistry    1
Maths        1
dtype: int64

In [5]:
df.isnull().sum().sum()

3

# Delete rows with missing data

In [6]:
newdf = df.dropna()
newdf

  Name  Physics  Chemistry  Maths
1  BBB     90.0       45.0   40.0

# Imputation - Replacing with a mean

In [8]:
df['Physics'] = df['Physics'].fillna(df['Physics'].mean())

In [9]:
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0    NaN
1  BBB     90.0       45.0   40.0
2  CCC     95.0       56.0   80.0
3  DDD     95.0        NaN   98.0

# Imputation - Replacing with a median

In [10]:
df['Chemistry'] = df['Chemistry'].fillna(df['Chemistry'].median())
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0    NaN
1  BBB     90.0       45.0   40.0
2  CCC     95.0       56.0   80.0
3  DDD     95.0       45.0   98.0

In [11]:
dict = {'Name':['AAA','BBB','CCC','DDD'],
        'Physics':[100, 90, np.nan, 95], 
        'Chemistry': [30, 45, 56, np.nan], 
        'Maths':[np.nan, 40, 80, 98]} 

df=pd.DataFrame(dict)
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0    NaN
1  BBB     90.0       45.0   40.0
2  CCC      NaN       56.0   80.0
3  DDD     95.0        NaN   98.0

In [13]:
df['Physics'] = df['Physics'].fillna(method='ffill')
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0    NaN
1  BBB     90.0       45.0   40.0
2  CCC     90.0       56.0   80.0
3  DDD     95.0        NaN   98.0

In [15]:
df['Maths'] = df['Maths'].fillna(method='bfill')
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0   40.0
1  BBB     90.0       45.0   40.0
2  CCC     90.0       56.0   80.0
3  DDD     95.0        NaN   98.0

In [16]:
df['Chemistry'] = df['Chemistry'].fillna(method='ffill')

In [17]:
df

  Name  Physics  Chemistry  Maths
0  AAA    100.0       30.0   40.0
1  BBB     90.0       45.0   40.0
2  CCC     90.0       56.0   80.0
3  DDD     95.0       56.0   98.0

1. WAP using pandas to remove missing values using data.csv where
    a. purch_amt using median
    b. sale_amt using mean
    c. ord_data using forward Fill
    d. salesman_id using either forward fill and backward fill
    e. ord_no using backward fill
    
2. WAP using pandas to remove missing values using data.csv where
    a. count the number of missing values each column has
    b. count total missing values
    c. delete rows with missing values